tutorials/elbow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wall-4
    {
        type            wall;
        inGroups        1(wall);
        nFaces          452;
        startFace       17370;
    }
    pressure-outlet-7
    {
        type            patch;
        nFaces          40;
        startFace       17822;
    }
    velocity-inlet-6
    {
        type            patch;
        nFaces          20;
        startFace       17862;
    }
    velocity-inlet-5
    {
        type            patch;
        nFaces          40;
        startFace       17882;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          17600;
        startFace       17922;
    }
)

// ************************************************************************* //
